TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
/* --COPYRIGHT--,BSD
 * Copyright (c) 2023, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * --/COPYRIGHT--*/

#include <stdint.h>
#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>


#include "smbus.h"
#include "smbus_nwk.h"
#include "smbus_phy.h"

#if defined(__MSPM0_HAS_I2C__)
void SMBus_PHY_disable(SMBus *smbus)
{
    DL_I2C_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2C_disablePower(smbus->phy.SMBus_Phy_i2cBase);

    smbus->ctrl.bits.phyEn = 0;      // Update control flag
}

void SMBus_PHY_targetDisable(SMBus *smbus)
{
    DL_I2C_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2C_disablePower(smbus->phy.SMBus_Phy_i2cBase);

    smbus->ctrl.bits.phyEn = 0;      // Update control flag
}

void SMBus_PHY_controllerDisable(SMBus *smbus)
{
    DL_I2C_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2C_disablePower(smbus->phy.SMBus_Phy_i2cBase);

    smbus->ctrl.bits.phyEn = 0;      // Update control flag
}

void SMBus_PHY_targetEnable(SMBus *smbus)
{
    extern void SYSCFG_DL_SMB_I2C_init(void);

    DL_I2C_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2C_enablePower(smbus->phy.SMBus_Phy_i2cBase);
    delay_cycles(SMB_POWER_STARTUP_DELAY);

    /*
        This implementation uses the SysConfig initialization.
        Developers can implement a custom initialization
    */
    SYSCFG_DL_SMB_I2C_init();
    smbus->ctrl.bits.phyEn = 1;      // Set global flag
}

void SMBus_PHY_targetInit(SMBus *smbus, I2C_Regs *i2cInst)
{
    SMBus_Phy *SMBusPHY = &smbus->phy;

    smbus->phy.SMBus_Phy_i2cBase = i2cInst;     /* Set the I2C Base Address */
    smbus->ctrl.bits.swackEn = true;            /* SW ACK is enabled */
    smbus->phy.SMBus_Phy_AckPending = false;    /* Clear Ack flag */

    SMBus_PHY_targetDisable(smbus);
    /* I2C init and enable done in SMBus_PHY_targetEnable */
    SMBus_PHY_targetEnable(smbus);
}

void SMBus_PHY_targetEnableInt(SMBus *smbus)
{

    DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2C_INTERRUPT_TARGET_PEC_RX_ERROR |
                                DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER |
                                DL_I2C_INTERRUPT_TARGET_START |
                                DL_I2C_INTERRUPT_TARGET_STOP |
                                DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY |
                                DL_I2C_INTERRUPT_TIMEOUT_A);
    DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_TARGET_START |
                            DL_I2C_INTERRUPT_TARGET_STOP |
                            DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY |
                            DL_I2C_INTERRUPT_TIMEOUT_A);
#if (SMB_TARGET_SUPPORTS_HOST_NOTIFY == true)
    DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                                DL_I2C_INTERRUPT_CONTROLLER_NACK |
                                DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                                DL_I2C_INTERRUPT_CONTROLLER_STOP );
    DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                           DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                           DL_I2C_INTERRUPT_CONTROLLER_NACK |
                           DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                           DL_I2C_INTERRUPT_CONTROLLER_STOP );
#endif /* SMB_TARGET_SUPPORTS_HOST_NOTIFY*/


    /* Set global flag */
    smbus->ctrl.bits.intEn = 1;
}

void SMBus_PHY_targetDisableInt(SMBus *smbus)
{

    DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_TARGET_PEC_RX_ERROR |
                            DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_TARGET_START |
                            DL_I2C_INTERRUPT_TARGET_STOP |
                            DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY |
                            DL_I2C_INTERRUPT_TIMEOUT_A);
#if (SMB_TARGET_SUPPORTS_HOST_NOTIFY == true)
    DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                            DL_I2C_INTERRUPT_CONTROLLER_NACK |
                            DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_CONTROLLER_STOP );
#endif /* SMB_TARGET_SUPPORTS_HOST_NOTIFY*/


