TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
    /* Set global flag */
    smbus->ctrl.bits.intEn = 0;
}

SMBus_State SMBus_PHY_targetProcessInt(SMBus *smbus)
{
    SMBus_State ret_state = SMBus_State_Target_NTR;
    SMBus_Phy *SMBusPHY = &smbus->phy;
    uint8_t data, addr;
    /* Prioritized interrupts processing */
    if ( DL_I2C_getEnabledInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                          DL_I2C_INTERRUPT_TARGET_STOP) )
    {
        ret_state = SMBus_NWK_targetProcessStop(smbus);
        DL_I2C_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                      DL_I2C_INTERRUPT_TARGET_STOP);
    }
    else if ( DL_I2C_getEnabledInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                               DL_I2C_INTERRUPT_TARGET_START) )
    {

        data = (uint8_t) DL_I2C_getTargetAddressMatch(SMBusPHY->SMBus_Phy_i2cBase);
        ret_state = SMBus_NWK_targetProcessStart(smbus, data);
        DL_I2C_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                      DL_I2C_INTERRUPT_TARGET_START);
    }
    else
    {
        switch (DL_I2C_getPendingInterrupt(SMBusPHY->SMBus_Phy_i2cBase)) {
            /* SMBus Target Interrupts */
            case DL_I2C_IIDX_TARGET_RXFIFO_TRIGGER:
                data = DL_I2C_receiveTargetData(SMBusPHY->SMBus_Phy_i2cBase);
                ret_state = SMBus_NWK_targetProcessRx(smbus, data);
				// Check if last byte in the transfer that the PEC checked out, 
				// otherwise NACK
                if(DL_I2C_getRawInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                              DL_I2C_INTERRUPT_TARGET_PEC_RX_ERROR)){

                    DL_I2C_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                              DL_I2C_INTERRUPT_TARGET_PEC_RX_ERROR);
                    smbus->status.bits.pecErr = 1;
                    ret_state = SMBus_State_PECError;
                }
                smbus->phy.SMBus_Phy_AckPending = true;
            break;
            case DL_I2C_IIDX_TARGET_START:
                /* Handled with higher priority */
            break;
            case DL_I2C_IIDX_TARGET_STOP:
                /* Handled with higher priority */
            break;
            case DL_I2C_IIDX_TARGET_TXFIFO_EMPTY:
                ret_state = SMBus_NWK_targetProcessTx(smbus, &data);
                DL_I2C_fillTargetTXFIFO(SMBusPHY->SMBus_Phy_i2cBase, &data, 1);
            break;
            case DL_I2C_IIDX_TARGET_PEC_RX_ERROR:
                smbus->status.bits.pecErr = 1;
                ret_state = SMBus_State_PECError;
            break;
            case DL_I2C_IIDX_TARGET_ARBITRATION_LOST:
                ret_state = SMBus_NWK_targetArbLost(smbus);
            break;
            /* SMBus Timeout interrupt */
            case DL_I2C_IIDX_TIMEOUT_A:
                ret_state = SMBus_NWK_targetProcessTimeout(smbus);
            break;
#if (SMB_TARGET_SUPPORTS_HOST_NOTIFY == true)
            /* SMBus Controller interrupts as target */
            case DL_I2C_IIDX_CONTROLLER_TX_DONE:
                SMBus_NWK_controllerTxDone(smbus);
            break;
            case DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER:
                /*
                 * TXIFG0 is set when the TX buffer is empty and we need to send
                 *  data to target
                 */
                ret_state = SMBus_NWK_controllerProcessTx(smbus, &data);
                // Send the data
                DL_I2C_fillControllerTXFIFO(SMBusPHY->SMBus_Phy_i2cBase, &data, 1);
            break;
            case DL_I2C_IIDX_CONTROLLER_NACK:
                ret_state = SMBus_NWK_controllerProcessNACK(smbus);
            break;
            case DL_I2C_IIDX_CONTROLLER_STOP:
                ret_state = SMBus_NWK_controllerProcessStop(smbus);
            break;
#endif /* SMB_TARGET_SUPPORTS_HOST_NOTIFY */
            default:
                break;

        }
    }
    return(ret_state);
}

void SMBus_PHY_targetSetPECCount(SMBus * smbus, uint16_t length){
    DL_I2C_setTargetPECCountValue(smbus->phy.SMBus_Phy_i2cBase, (uint32_t) 0x00000000 | length);
}

void SMBus_PHY_targetManualACK(SMBus *smbus, bool ackVal)
{
    if (ackVal == true)
    {
        DL_I2C_setTargetACKOverrideValue(smbus->phy.SMBus_Phy_i2cBase,
                                    DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_ACK);
    }
    else
    {
        DL_I2C_setTargetACKOverrideValue(smbus->phy.SMBus_Phy_i2cBase,
                                    DL_I2C_TARGET_RESPONSE_OVERRIDE_VALUE_NACK);
    }
    smbus->phy.SMBus_Phy_AckPending = false;
}
void SMBus_Phy_ARP_TARGET_ADDR_Reset(SMBus *smbus)
{
    if(smbus->arpStatus.arpAddressValid)
    {
        DL_I2C_setTargetOwnAddress(smbus->phy.SMBus_Phy_i2cBase, smbus->ownTargetAddr);
        DL_I2C_enableTargetOwnAddress(smbus->phy.SMBus_Phy_i2cBase);
    }
    else
    {
        DL_I2C_disableTargetOwnAddress(smbus->phy.SMBus_Phy_i2cBase);
    }
}
uint8_t SMBus_Phy_ARP_Get_Write_Status(SMBus *smbus)
{
    return(smbus->arpStatus.arpWriteState & I2C_SSR_RXMODE_SET);
}
uint8_t SMBus_Phy_ARP_Get_Read_Status(SMBus *smbus)
{
    return(smbus->arpStatus.arpWriteState & I2C_SSR_TXMODE_SET);
}
void SMBus_PHY_controllerEnable(SMBus *smbus)
{
    extern void SYSCFG_DL_SMB_I2C_init(void);

    DL_I2C_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2C_enablePower(smbus->phy.SMBus_Phy_i2cBase);
    delay_cycles(SMB_POWER_STARTUP_DELAY);

    /*
        This implementation uses the SysConfig initialization.
        Developers can implement a custom initialization
    */
    SYSCFG_DL_SMB_I2C_init();

    smbus->ctrl.bits.phyEn = 1;      // Set global flag
}

void SMBus_PHY_controllerEnableInt(SMBus *smbus)
{
    DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                                DL_I2C_INTERRUPT_CONTROLLER_NACK |
                                DL_I2C_INTERRUPT_CONTROLLER_PEC_RX_ERROR |
                                DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                                DL_I2C_INTERRUPT_CONTROLLER_START |
                                DL_I2C_INTERRUPT_CONTROLLER_STOP |
                                DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER |
                                DL_I2C_INTERRUPT_TIMEOUT_A);
    DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                            DL_I2C_INTERRUPT_CONTROLLER_NACK |
                            DL_I2C_INTERRUPT_CONTROLLER_PEC_RX_ERROR |
                            DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_CONTROLLER_START |
                            DL_I2C_INTERRUPT_CONTROLLER_STOP |
                            DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_TIMEOUT_A);
#if (SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY == true)
    DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER |
                                DL_I2C_INTERRUPT_TARGET_START |
                                DL_I2C_INTERRUPT_TARGET_STOP |
                                DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY );
    DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                           DL_I2C_INTERRUPT_TARGET_START |
                           DL_I2C_INTERRUPT_TARGET_STOP |
                           DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY );
#endif /* SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY */


