TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
    /* Set global flag */
    smbus->ctrl.bits.intEn = 1;
}

void SMBus_PHY_controllerDisableInt(SMBus *smbus)
{
    DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_CONTROLLER_ARBITRATION_LOST |
                            DL_I2C_INTERRUPT_CONTROLLER_NACK |
                            DL_I2C_INTERRUPT_CONTROLLER_PEC_RX_ERROR |
                            DL_I2C_INTERRUPT_CONTROLLER_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_CONTROLLER_START |
                            DL_I2C_INTERRUPT_CONTROLLER_STOP |
                            DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_TIMEOUT_A);
#if (SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY == true)
    DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_TARGET_RXFIFO_TRIGGER |
                            DL_I2C_INTERRUPT_TARGET_START |
                            DL_I2C_INTERRUPT_TARGET_STOP |
                            DL_I2C_INTERRUPT_TARGET_TXFIFO_EMPTY );
#endif /* SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY */

    /* Set global flag */
    smbus->ctrl.bits.intEn = 0;
}

void SMBus_PHY_controllerInit(SMBus *smbus,
                          I2C_Regs *i2cRegs,
                          uint32_t busClk)
{
    SMBus_Phy *SMBusPHY = &smbus->phy;
    smbus->phy.SMBus_Phy_i2cBase = i2cRegs;

    // Target Address not initialized by default
    smbus->ownTargetAddr = 0;

    SMBus_PHY_controllerDisable(smbus);
    /* I2C init and enable done in SMBus_PHY_controllerEnable */
    SMBus_PHY_controllerEnable(smbus);
}

void SMBus_PHY_controllerSendStop(SMBus *smbus)
{
        DL_I2C_startControllerTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                               0x0, // This is a don't care
                                               DL_I2C_CONTROLLER_DIRECTION_TX,
                                               0,
                                               DL_I2C_CONTROLLER_START_DISABLE,
                                               DL_I2C_CONTROLLER_STOP_ENABLE,
                                               DL_I2C_CONTROLLER_ACK_DISABLE);
}

void SMBus_PHY_controllerStartTx(SMBus *smbus,
                             uint8_t targetaddr,
                             uint16_t length,
                             SMBus_Stop stopFlag,
                             uint8_t setPEC)

{
    uint8_t data;
    DL_I2C_CONTROLLER_STOP phy_stop;

    if (stopFlag == SMBus_Stop_After_Transfer)
    {
        phy_stop = DL_I2C_CONTROLLER_STOP_ENABLE;
        DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase, DL_I2C_INTERRUPT_CONTROLLER_TX_DONE);
    }
    else
    {
        phy_stop = DL_I2C_CONTROLLER_STOP_DISABLE;
        DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase, DL_I2C_INTERRUPT_CONTROLLER_TX_DONE);
        DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase, DL_I2C_INTERRUPT_CONTROLLER_TX_DONE);
    }


    if (length > 0) {
      DL_I2C_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                             DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER);
      DL_I2C_flushControllerTXFIFO(smbus->phy.SMBus_Phy_i2cBase);
      DL_I2C_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                  DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER);
      DL_I2C_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2C_INTERRUPT_CONTROLLER_TXFIFO_TRIGGER);

      SMBus_NWK_controllerProcessTx(smbus, &data);
      DL_I2C_fillControllerTXFIFO(smbus->phy.SMBus_Phy_i2cBase, &data, 1);
    }

    if (setPEC == 1 && smbus->ctrl.bits.pecEn == 1) {
        DL_I2C_setControllerPECCountValue(smbus->phy.SMBus_Phy_i2cBase, length);
    }
    else {
        DL_I2C_setControllerPECCountValue(smbus->phy.SMBus_Phy_i2cBase, 0);
    }

    DL_I2C_startControllerTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                           targetaddr,
                                           DL_I2C_CONTROLLER_DIRECTION_TX,
                                           length,
                                           DL_I2C_CONTROLLER_START_ENABLE,
                                           phy_stop,
                                           DL_I2C_CONTROLLER_ACK_ENABLE);
}

void SMBus_PHY_controllerStartRx(SMBus *smbus,
                             uint8_t targetaddr,
                             uint16_t length,
                             SMBus_Start startFlag,
                             SMBus_Stop stopFlag,
                             SMBus_Auto_Ack ackFlag,
                             uint8_t setPEC)
{
    DL_I2C_CONTROLLER_START phy_start;
    DL_I2C_CONTROLLER_STOP phy_stop;
    DL_I2C_CONTROLLER_ACK phy_ack;
    uint8_t data;
    volatile uint32_t timeout = SMB_SW_TIMEOUT;

    if (startFlag == SMBus_Start_Before_Transfer)
    {
        phy_start = DL_I2C_CONTROLLER_START_ENABLE;
    }
    else
    {
        phy_start = DL_I2C_CONTROLLER_START_DISABLE;
    }

    if (stopFlag == SMBus_Stop_After_Transfer)
    {
        phy_stop = DL_I2C_CONTROLLER_STOP_ENABLE;
    }
    else
    {
        phy_stop = DL_I2C_CONTROLLER_STOP_DISABLE;
    }

    if (ackFlag == SMBus_Auto_Ack_Last_Byte)
    {
        phy_ack = DL_I2C_CONTROLLER_ACK_ENABLE;
    }
    else
    {
        phy_ack = DL_I2C_CONTROLLER_ACK_DISABLE;
    }

    if (setPEC == 1 && smbus->ctrl.bits.pecEn == 1) {
        DL_I2C_setControllerPECCountValue(smbus->phy.SMBus_Phy_i2cBase, length);
    }
    else {
        DL_I2C_setControllerPECCountValue(smbus->phy.SMBus_Phy_i2cBase, 0);
    }

    // HW will ignore new transfer requests while a transfer is active, so wait until the HW is ready + 1 delay_cycle
    // In normal operation this should just be a small region of time between when the HW has received a byte
    // and while ack is being generated.
    while (timeout &&
               ( (DL_I2C_getControllerStatus(smbus->phy.SMBus_Phy_i2cBase) |
                       DL_I2C_CONTROLLER_STATUS_BUSY) ==
                       DL_I2C_CONTROLLER_STATUS_BUSY ) )
    {
        timeout--;
    }


    DL_I2C_startControllerTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                           targetaddr,
                                           DL_I2C_CONTROLLER_DIRECTION_RX,
                                           length,
                                           phy_start,
                                           phy_stop,
                                           phy_ack);

