TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
}

void SMBus_PHY_controllerEnableHostNotify(SMBus *smbus)
{
    DL_I2C_enableDefaultHostAddress(smbus->phy.SMBus_Phy_i2cBase);
}

void SMBus_PHY_controllerDisableHostNotify(SMBus *smbus)
{
    DL_I2C_disableDefaultHostAddress(smbus->phy.SMBus_Phy_i2cBase);
}


SMBus_State SMBus_PHY_controllerProcessInt(SMBus *smbus)
{
    uint8_t data;
    SMBus_State ret_state;
    SMBus_Phy *SMBusPHY = &smbus->phy;

    switch (DL_I2C_getPendingInterrupt(SMBusPHY->SMBus_Phy_i2cBase)) {
        /* SMBus Controller interrupts */
        case DL_I2C_IIDX_CONTROLLER_TX_DONE:
            SMBus_NWK_controllerTxDone(smbus);
        break;
        case DL_I2C_IIDX_CONTROLLER_RXFIFO_TRIGGER:
            data = DL_I2C_receiveControllerData(SMBusPHY->SMBus_Phy_i2cBase);
           // Pass data to NWK layer
           ret_state = SMBus_NWK_controllerProcessRx(smbus, data);
        break;
        case DL_I2C_IIDX_CONTROLLER_TXFIFO_TRIGGER:
            // TXIFG0 is set when the TX buffer is empty and we need to send data to
            // target
            ret_state = SMBus_NWK_controllerProcessTx(smbus, &data);
            // Send the data
            DL_I2C_fillControllerTXFIFO(SMBusPHY->SMBus_Phy_i2cBase, &data, 1);
        break;
        case DL_I2C_IIDX_CONTROLLER_NACK:
            ret_state = SMBus_NWK_controllerProcessNACK(smbus);
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        case DL_I2C_IIDX_CONTROLLER_START:
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        case DL_I2C_IIDX_CONTROLLER_STOP:
            ret_state = SMBus_NWK_controllerProcessStop(smbus);
        break;
        case DL_I2C_IIDX_CONTROLLER_ARBITRATION_LOST:
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        /* SMBus Timeout interrupt */
        case DL_I2C_IIDX_TIMEOUT_A:
            ret_state = SMBus_NWK_controllerProcessTimeout(smbus);
        break;
#if (SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY == true)
        /* SMBus Controller interrupts as target */
        case DL_I2C_IIDX_TARGET_RXFIFO_TRIGGER:
            data = DL_I2C_receiveTargetData(SMBusPHY->SMBus_Phy_i2cBase);
            ret_state = SMBus_NWK_targetProcessRx(smbus, data);
        break;
        case DL_I2C_IIDX_TARGET_START:
            data = (uint8_t) DL_I2C_getTargetAddressMatch(SMBusPHY->SMBus_Phy_i2cBase);
            ret_state = SMBus_NWK_targetProcessStart(smbus, data);
        break;
        case DL_I2C_IIDX_TARGET_STOP:
            ret_state = SMBus_NWK_targetProcessStop(smbus);
        break;
#endif  /* SMB_CONTROLLER_SUPPORTS_HOST_NOTIFY*/
        default:
        break;
    }

    return(ret_state);
}
#endif

#if defined(__MCU_HAS_UNICOMMI2CC__) && defined(__MCU_HAS_UNICOMMI2CT__)

void SMBus_PHY_controllerDisable(SMBus *smbus)
{
    DL_I2CC_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2CC_disablePower(smbus->phy.SMBus_Phy_i2cBase);

    smbus->ctrl.bits.phyEn = 0;      // Update control flag
}

void SMBus_PHY_targetDisable(SMBus *smbus)
{
    DL_I2CT_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2CT_disablePower(smbus->phy.SMBus_Phy_i2cBase);

    smbus->ctrl.bits.phyEn = 0;      // Update control flag
}

void SMBus_PHY_targetEnable(SMBus *smbus)
{
    extern void SYSCFG_DL_SMB_I2C_init(void);

    DL_I2CT_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2CT_enablePower(smbus->phy.SMBus_Phy_i2cBase);
    delay_cycles(SMB_POWER_STARTUP_DELAY);

    /*
        This implementation uses the SysConfig initialization.
        Developers can implement a custom initialization
    */
    SYSCFG_DL_SMB_I2C_init();
    smbus->ctrl.bits.phyEn = 1;      // Set global flag
}

void SMBus_PHY_targetInit(SMBus *smbus, UNICOMM_Inst_Regs *i2cInst)
{
    SMBus_Phy *SMBusPHY = &smbus->phy;

    smbus->phy.SMBus_Phy_i2cBase = i2cInst;     /* Set the I2C Base Address */
    smbus->ctrl.bits.swackEn = true;            /* SW ACK is enabled */
    smbus->phy.SMBus_Phy_AckPending = false;    /* Clear Ack flag */

    SMBus_PHY_targetDisable(smbus);
    /* I2C init and enable done in SMBus_PHY_targetEnable */
    SMBus_PHY_targetEnable(smbus);
}

void SMBus_PHY_targetEnableInt(SMBus *smbus)
{

    DL_I2CT_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2CT_INTERRUPT_PEC_RX_ERROR |
                                DL_I2CT_INTERRUPT_RXFIFO_TRIGGER |
                                DL_I2CT_INTERRUPT_START |
                                DL_I2CT_INTERRUPT_STOP |
                                DL_I2CT_INTERRUPT_TXFIFO_EMPTY |
                                DL_I2CT_INTERRUPT_TIMEOUT_A);
    DL_I2CT_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2CT_INTERRUPT_RXFIFO_TRIGGER |
                            DL_I2CT_INTERRUPT_START |
                            DL_I2CT_INTERRUPT_STOP |
                            DL_I2CT_INTERRUPT_TXFIFO_EMPTY |
                            DL_I2CT_INTERRUPT_TIMEOUT_A);

    /* Set global flag */
    smbus->ctrl.bits.intEn = 1;
}

void SMBus_PHY_targetDisableInt(SMBus *smbus)
{

    DL_I2CT_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2CT_INTERRUPT_PEC_RX_ERROR |
                            DL_I2CT_INTERRUPT_RXFIFO_TRIGGER |
                            DL_I2CT_INTERRUPT_START |
                            DL_I2CT_INTERRUPT_STOP |
                            DL_I2CT_INTERRUPT_TXFIFO_EMPTY |
                            DL_I2CT_INTERRUPT_TIMEOUT_A);

    /* Set global flag */
    smbus->ctrl.bits.intEn = 0;
}

SMBus_State SMBus_PHY_targetProcessInt(SMBus *smbus)
{
    SMBus_State ret_state = SMBus_State_Target_NTR;
    SMBus_Phy *SMBusPHY = &smbus->phy;
    uint8_t data, addr;
    /* Prioritized interrupts processing */
    if ( DL_I2CT_getEnabledInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                          DL_I2CT_INTERRUPT_STOP) )
    {
        ret_state = SMBus_NWK_targetProcessStop(smbus);
        DL_I2CT_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                      DL_I2CT_INTERRUPT_STOP);
    }
    else if ( DL_I2CT_getEnabledInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                               DL_I2CT_INTERRUPT_START) )
    {

        data = (uint8_t) DL_I2CT_getAddressMatch(SMBusPHY->SMBus_Phy_i2cBase);
        ret_state = SMBus_NWK_targetProcessStart(smbus, data);
        DL_I2CT_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                      DL_I2CT_INTERRUPT_START);
    }
    else
    {
        switch (DL_I2CT_getPendingInterrupt(SMBusPHY->SMBus_Phy_i2cBase)) {
            /* SMBus Target Interrupts */
            case DL_I2CT_IIDX_RXFIFO_TRIGGER:
                data = DL_I2CT_receiveData(SMBusPHY->SMBus_Phy_i2cBase);
                ret_state = SMBus_NWK_targetProcessRx(smbus, data);
                // Check if last byte in the transfer that the PEC checked out,
                // otherwise NACK
                if(DL_I2CT_getRawInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                              DL_I2CT_INTERRUPT_PEC_RX_ERROR)){

