TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
                    DL_I2CT_clearInterruptStatus(SMBusPHY->SMBus_Phy_i2cBase,
                                              DL_I2CT_INTERRUPT_PEC_RX_ERROR);
                    smbus->status.bits.pecErr = 1;
                    ret_state = SMBus_State_PECError;
                }
                smbus->phy.SMBus_Phy_AckPending = true;
            break;
            case DL_I2CT_IIDX_START:
                /* Handled with higher priority */
            break;
            case DL_I2CT_IIDX_STOP:
                /* Handled with higher priority */
            break;
            case DL_I2CT_IIDX_TXFIFO_EMPTY:
                ret_state = SMBus_NWK_targetProcessTx(smbus, &data);
                DL_I2CT_fillTXFIFO(SMBusPHY->SMBus_Phy_i2cBase, &data, 1);
            break;
            case DL_I2CT_IIDX_PEC_RX_ERROR:
                smbus->status.bits.pecErr = 1;
                ret_state = SMBus_State_PECError;
            break;
            case DL_I2CT_IIDX_ARBITRATION_LOST:
                ret_state = SMBus_NWK_targetArbLost(smbus);
            break;
            /* SMBus Timeout interrupt */
            case DL_I2CT_IIDX_TIMEOUT_A:
                ret_state = SMBus_NWK_targetProcessTimeout(smbus);
            break;

            default:
                break;

        }
    }
    return(ret_state);
}

void SMBus_PHY_targetSetPECCount(SMBus * smbus, uint16_t length){
    DL_I2CT_setPECCountValue(smbus->phy.SMBus_Phy_i2cBase, (uint32_t) 0x00000000 | length);
}

void SMBus_PHY_targetManualACK(SMBus *smbus, bool ackVal)
{
    if (ackVal == true)
    {
        DL_I2CT_setACKOverrideValue(smbus->phy.SMBus_Phy_i2cBase,
                                    DL_I2CT_RESPONSE_OVERRIDE_VALUE_ACK);
    }
    else
    {
        DL_I2CT_setACKOverrideValue(smbus->phy.SMBus_Phy_i2cBase,
                                    DL_I2CT_RESPONSE_OVERRIDE_VALUE_NACK);
    }
    smbus->phy.SMBus_Phy_AckPending = false;
}
void SMBus_Phy_ARP_TARGET_ADDR_Reset(SMBus *smbus)
{
    if(smbus->arpStatus.arpAddressValid)
    {
        DL_I2CT_setOwnAddress(smbus->phy.SMBus_Phy_i2cBase, smbus->ownTargetAddr);
        DL_I2CT_enableOwnAddress(smbus->phy.SMBus_Phy_i2cBase);
    }
    else
    {
        DL_I2CT_disableOwnAddress(smbus->phy.SMBus_Phy_i2cBase);
    }
}
uint8_t SMBus_Phy_ARP_Get_Write_Status(SMBus *smbus)
{
    return(smbus->arpStatus.arpWriteState & UNICOMMI2CT_SR_RXMODE_SET);
}
uint8_t SMBus_Phy_ARP_Get_Read_Status(SMBus *smbus)
{
    return(smbus->arpStatus.arpWriteState & UNICOMMI2CT_SR_TXMODE_SET);
}

void SMBus_PHY_controllerEnable(SMBus *smbus)
{
    extern void SYSCFG_DL_SMB_I2C_init(void);

    DL_I2CC_reset(smbus->phy.SMBus_Phy_i2cBase);
    DL_I2CC_enablePower(smbus->phy.SMBus_Phy_i2cBase);
    delay_cycles(SMB_POWER_STARTUP_DELAY);

    /*
        This implementation uses the SysConfig initialization.
        Developers can implement a custom initialization
    */
    SYSCFG_DL_SMB_I2C_init();

    smbus->ctrl.bits.phyEn = 1;      // Set global flag
}

void SMBus_PHY_controllerEnableInt(SMBus *smbus)
{
    DL_I2CC_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                DL_I2CC_INTERRUPT_ARBITRATION_LOST |
                                DL_I2CC_INTERRUPT_NACK |
                                DL_I2CC_INTERRUPT_PEC_RX_ERROR |
                                DL_I2CC_INTERRUPT_RXFIFO_TRIGGER |
                                DL_I2CC_INTERRUPT_START |
                                DL_I2CC_INTERRUPT_STOP |
                                DL_I2CC_INTERRUPT_TXFIFO_TRIGGER |
                                DL_I2CC_INTERRUPT_TIMEOUT_A);
    DL_I2CC_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2CC_INTERRUPT_ARBITRATION_LOST |
                            DL_I2CC_INTERRUPT_NACK |
                            DL_I2CC_INTERRUPT_PEC_RX_ERROR |
                            DL_I2CC_INTERRUPT_RXFIFO_TRIGGER |
                            DL_I2CC_INTERRUPT_START |
                            DL_I2CC_INTERRUPT_STOP |
                            DL_I2CC_INTERRUPT_TXFIFO_TRIGGER |
                            DL_I2CC_INTERRUPT_TIMEOUT_A);

    /* Set global flag */
    smbus->ctrl.bits.intEn = 1;
}

void SMBus_PHY_controllerDisableInt(SMBus *smbus)
{
    DL_I2CC_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2CC_INTERRUPT_ARBITRATION_LOST |
                            DL_I2CC_INTERRUPT_NACK |
                            DL_I2CC_INTERRUPT_PEC_RX_ERROR |
                            DL_I2CC_INTERRUPT_RXFIFO_TRIGGER |
                            DL_I2CC_INTERRUPT_START |
                            DL_I2CC_INTERRUPT_STOP |
                            DL_I2CC_INTERRUPT_TXFIFO_TRIGGER |
                            DL_I2CC_INTERRUPT_TIMEOUT_A);

    /* Set global flag */
    smbus->ctrl.bits.intEn = 0;
}

void SMBus_PHY_controllerInit(SMBus *smbus,
                              UNICOMM_Inst_Regs *i2cRegs,
                          uint32_t busClk)
{
    SMBus_Phy *SMBusPHY = &smbus->phy;
    smbus->phy.SMBus_Phy_i2cBase = i2cRegs;

    // Target Address not initialized by default
    smbus->ownTargetAddr = 0;

    SMBus_PHY_controllerDisable(smbus);
    /* I2C init and enable done in SMBus_PHY_controllerEnable */
    SMBus_PHY_controllerEnable(smbus);
}

void SMBus_PHY_controllerSendStop(SMBus *smbus)
{
        DL_I2CC_startTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                       0x0, // This is a don't care
                                       DL_I2CC_DIRECTION_TX,
                                       0,
                                       DL_I2CC_START_DISABLE,
                                       DL_I2CC_STOP_ENABLE,
                                       DL_I2CC_ACK_DISABLE);
}


void SMBus_PHY_controllerStartTx(SMBus *smbus,
                             uint8_t targetaddr,
                             uint16_t length,
                             SMBus_Stop stopFlag,
                             uint8_t setPEC)

{
    uint8_t data;
    DL_I2CC_STOP phy_stop;

