TexasInstruments/mspm0-sdk/source/ti/smbus/smbus_phy.c
    if (stopFlag == SMBus_Stop_After_Transfer)
    {
        phy_stop = DL_I2CC_STOP_ENABLE;
        DL_I2CC_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase, DL_I2CC_INTERRUPT_TX_DONE);
    }
    else
    {
        phy_stop = DL_I2CC_STOP_DISABLE;
        DL_I2CC_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase, DL_I2CC_INTERRUPT_TX_DONE);
        DL_I2CC_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase, DL_I2CC_INTERRUPT_TX_DONE);
    }

    if (length > 0) {
      DL_I2CC_disableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                             DL_I2CC_INTERRUPT_TXFIFO_TRIGGER);
      DL_I2CC_flushTXFIFO(smbus->phy.SMBus_Phy_i2cBase);
      DL_I2CC_clearInterruptStatus(smbus->phy.SMBus_Phy_i2cBase,
                                  DL_I2CC_INTERRUPT_TXFIFO_TRIGGER);
      DL_I2CC_enableInterrupt(smbus->phy.SMBus_Phy_i2cBase,
                            DL_I2CC_INTERRUPT_TXFIFO_TRIGGER);

      SMBus_NWK_controllerProcessTx(smbus, &data);
      DL_I2CC_fillTXFIFO(smbus->phy.SMBus_Phy_i2cBase, &data, 1);
    }

    if (setPEC == 1 && smbus->ctrl.bits.pecEn == 1) {
        DL_I2CC_setPECCountValue(smbus->phy.SMBus_Phy_i2cBase, length);
    }
    else {
        DL_I2CC_setPECCountValue(smbus->phy.SMBus_Phy_i2cBase, 0);
    }

    DL_I2CC_startTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                   targetaddr,
                                   DL_I2CC_DIRECTION_TX,
                                   length,
                                   DL_I2CC_START_ENABLE,
                                   phy_stop,
                                   DL_I2CC_ACK_ENABLE);
}

void SMBus_PHY_controllerStartRx(SMBus *smbus,
                             uint8_t targetaddr,
                             uint16_t length,
                             SMBus_Start startFlag,
                             SMBus_Stop stopFlag,
                             SMBus_Auto_Ack ackFlag,
                             uint8_t setPEC)
{
    DL_I2CC_START phy_start;
    DL_I2CC_STOP phy_stop;
    DL_I2CC_ACK phy_ack;
    uint8_t data;
    volatile uint32_t timeout = SMB_SW_TIMEOUT;

    if (startFlag == SMBus_Start_Before_Transfer)
    {
        phy_start = DL_I2CC_START_ENABLE;
    }
    else
    {
        phy_start = DL_I2CC_START_DISABLE;
    }

    if (stopFlag == SMBus_Stop_After_Transfer)
    {
        phy_stop = DL_I2CC_STOP_ENABLE;
    }
    else
    {
        phy_stop = DL_I2CC_STOP_DISABLE;
    }

    if (ackFlag == SMBus_Auto_Ack_Last_Byte)
    {
        phy_ack = DL_I2CC_ACK_ENABLE;
    }
    else
    {
        phy_ack = DL_I2CC_ACK_DISABLE;
    }

    if (setPEC == 1 && smbus->ctrl.bits.pecEn == 1) {
        DL_I2CC_setPECCountValue(smbus->phy.SMBus_Phy_i2cBase, length);
    }
    else {
        DL_I2CC_setPECCountValue(smbus->phy.SMBus_Phy_i2cBase, 0);
    }

    // HW will ignore new transfer requests while a transfer is active, so wait until the HW is ready + 1 delay_cycle
    // In normal operation this should just be a small region of time between when the HW has received a byte
    // and while ack is being generated.
    while (timeout &&
               ( (DL_I2CC_getStatus(smbus->phy.SMBus_Phy_i2cBase) |
                       DL_I2CC_STATUS_BUSY) ==
                       DL_I2CC_STATUS_BUSY ) )
    {
        timeout--;
    }


    DL_I2CC_startTransferAdvanced(smbus->phy.SMBus_Phy_i2cBase,
                                   targetaddr,
                                   DL_I2CC_DIRECTION_RX,
                                   length,
                                   phy_start,
                                   phy_stop,
                                   phy_ack);

}

SMBus_State SMBus_PHY_controllerProcessInt(SMBus *smbus)
{
    uint8_t data;
    SMBus_State ret_state;
    SMBus_Phy *SMBusPHY = &smbus->phy;

    switch (DL_I2CC_getPendingInterrupt(SMBusPHY->SMBus_Phy_i2cBase)) {
        /* SMBus Controller interrupts */
        case DL_I2CC_IIDX_TX_DONE:
            SMBus_NWK_controllerTxDone(smbus);
        break;
        case DL_I2CC_IIDX_RXFIFO_TRIGGER:
            data = DL_I2CC_receiveData(SMBusPHY->SMBus_Phy_i2cBase);
           // Pass data to NWK layer
           ret_state = SMBus_NWK_controllerProcessRx(smbus, data);
        break;
        case DL_I2CC_IIDX_TXFIFO_TRIGGER:
            // TXIFG0 is set when the TX buffer is empty and we need to send data to
            // target
            ret_state = SMBus_NWK_controllerProcessTx(smbus, &data);
            // Send the data
            DL_I2CC_fillTXFIFO(SMBusPHY->SMBus_Phy_i2cBase, &data, 1);
        break;
        case DL_I2CC_IIDX_NACK:
            ret_state = SMBus_NWK_controllerProcessNACK(smbus);
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        case DL_I2CC_IIDX_START:
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        case DL_I2CC_IIDX_STOP:
            ret_state = SMBus_NWK_controllerProcessStop(smbus);
        break;
        case DL_I2CC_IIDX_ARBITRATION_LOST:
            //__BKPT(0); /* Placeholder for debugging purposes */
        break;
        /* SMBus Timeout interrupt */
        case DL_I2CC_IIDX_TIMEOUT_A:
            ret_state = SMBus_NWK_controllerProcessTimeout(smbus);
        break;

        default:
        break;
    }

    return(ret_state);
}


#endif



